# -*- coding: utf-8 -*-
"""
Created on Thu Aug 24 15:29:03 2023

@author: itadmin
"""

# -*- coding: utf-8 -*-
"""
Created on Thu Aug 10 17:17:41 2023

@author: itadmin
"""

import pandas as pd
fname = pd.Series(['风机控制系统供电电源故障', '启动风机', '停止风机', '风机自动重启', '维护开关启动', '提示风机维护开关关闭',
       '硬件版本错误', '提示风机手动复位信息', '启动塔基控制柜上的紧急停止按钮', '塔基 PLC FM211 故障',
       '塔基 PLC DIO248 故障', '塔基 PLC AIO288 故障', '变频器 CAN 不能启动', '本地操作模式',
       '远程操作模式', '变频器不能启动', '参数文件读/写故障', '配置故障', '主变频器故障请求', '从变频器故障请求',
       '主变频器 MCB 故障', '从变频器 MCB 故障', '变频器数据库配置故障', '变频器未准备好', '发电机超速',
       '电网功率超出最大范围', '轮毂转速和发电机转速误差过大', '交换机故障', '塔基 UPS 故障', '塔基避雷器故障',
       '变频器不能断开', '仿真状态', '工厂测试状态', '现场测试状态', '同远程接口单元通讯丢失',
       '错误的转矩符号或错误的功率符号', '叶片结冰故障', '同风电场功率控制系统通讯丢失', '停机控制故障', '电网电压故障',
       '远程维护启动', '主控状态和变桨状态不匹配', '塔底轴流风扇过载', '塔底轴流风扇过热', '变桨力矩给定与反馈不一致',
       '角度跳变', '变桨速度给定与反馈不一致', '桨叶角度多次不一致', '冷却液温度太高', '冷却泵压力 2 太低',
       '冷却泵压力 2 太高', '冷却泵过载', '变频器环境温度超出操作范围', '变频器温度错误', '冷却液温度 1 错误',
       '冷却液温度 2 错误', '冷却泵压力 1 错误', '冷却泵压力 2 错误', '冷却泵 P2-P1 太小（压力差）',
       '加热器温度太高', '电网频率超出范围', '变压器故障请求', '变压器温度报警', '冷却液温度高', '塔基温度超限',
       '热交换风扇 1 过载', '热交换风扇 2 过载', '冷却液温度差高/ 变频器降额', '冷却液压力 2 低',
       '冷却液压力 2 高', '冷却液压力差低', '变频器加热器过载', '变频器加热请求信号', '扭缆齿盘掉落或扭缆传感器异常',
       '解缆', '风速太高', '暴风停机', '暴风停机模式取消', '解缆超时', '机舱 400Vac 电网故障',
       '机舱 PLC CM202 故障', '机舱 PLC EM203 故障', '机舱PLC PTAI216 故障',
       '机舱 PLC AIO288 故障', '机舱 PLC DIO280 故障', '机舱 PLC  CM202 CAN故障',
       '扇区管理激活', '电动模式打开', '启动维护制动', '轮毂锁紧销未收回', '轮毂锁紧销传感器故障', '偏航超时',
       '偏航电机保护开关故障', '偏航电机工作开关激活', '扭缆限位开关激活', '扭缆传感器故障', '偏航制动压力太低',
       '偏航制动压力传感器故障', '风速计故障', '风向标 1 结冰', '风向标 2 结冰', '风向标 1-2 不一致',
       '风机外界操作温度超限', '外界温度信号故障', '塔基加速度高', '加速度传感器故障', '风向标 1 故障',
       '风向标 2 故障', '主轴承温度 1 太高', '主轴承温度 2 太高', '主轴承温度 1 故障', '主轴承温度 2 故障',
       '发电机定子温度 1 太高', '发电机定子温度 2 太高', '发电机定子温度 3 太高', '发电机定子温度 4 太高',
       '发电机定子温度 5 太高', '发电机定子温度 6 太高', '发电机定子温度 1 错误', '发电机定子温度 2 错误',
       '发电机定子温度 3 错误', '发电机定子温度 4 错误', '发电机定子温度 5 错误', '发电机定子温度 6 错误',
       '机舱控制柜内温度超出范围', '机舱控制柜温度错误', '机舱烟雾检测', '偏航背压过低', '偏航制动压力低',
       '偏航制动漏油', '主轴承温度 1 高', '主轴承温度 2 高', '发电机定子温度 1 高', '发电机定子温度 2 高',
       '发电机定子温度 3 高', '发电机定子温度 4 高', '发电机定子温度 5 高', '发电机定子温度 6 高',
       '发电机气隙温度 1 错误', '发电机气隙温度 2 错误', '偏航制动油温太低', '机舱温度超限', '机舱温度信号错误',
       '主轴承油脂罐液位低', '主轴承油脂泵手动模式', '偏航轴承油脂流量小', '偏航轴承油脂罐液位低',
       '偏航轴承油脂泵手动模式', '冷却扇 1 手动模式', '解缆受阻：风速高', '液压油位低', '主轴承油脂流量小',
       '发电机加热除湿器过载', '机舱灭火系统报警触发', '塔基灭火系统报警', '冷却扇过载', '偏航制动液压泵过载',
       '左偏航命令失效', '右偏航命令失效', '机舱三相电源 1 故障', '机舱三相电源 2 故障', '机舱热鼓风机 1 过载',
       '机舱 UPS 电源故障', '看门狗故障', '紧急变桨系统测试', '紧急变桨测试 OK', '超速测试', '超速测试 OK',
       '叶片 1，2 不一致', '叶片 1，3 不一致', '叶片 2，3 不一致', '变桨驱动 1 故障', '变桨驱动 2 故障',
       '变桨驱动 3 故障', '叶片 1CAN 通讯错误', '叶片 2CAN 通讯错误', '叶片 3CAN 通讯错误',
       '轮毂转速太高', '叶片 1 电容组极性错误', '叶片 2 电容组极性错误', '叶片 3 电容组极性错误',
       '叶片 1 电容组电压不正常', '叶片 2 电容组电压不正常', '叶片 3 电容组电压不正常', '叶片 1 电容组温度不正常',
       '叶片 2 电容组温度不正常', '叶片 3 电容组温度不正常', '偏航保护模式激活', '变桨算法运行错误',
       '叶片 1 编码器故障', '叶片 2 编码器故障', '叶片 3 编码器故障', '叶片 1 伺服系统超时',
       '叶片 2 伺服系统超时', '叶片 3 伺服系统超时', '限位开关 1 位置错误', '限位开关 2 位置错误',
       '限位开关 3 位置错误', '叶片 1-2 不一致', '叶片 1-3 不一致', '叶片 2-3 不一致',
       '叶片 1 变桨电机温度高', '叶片 2 变桨电机温度高', '叶片 3 变桨电机温度高', '驱动柜 1 的温度超出范围',
       '驱动柜 2 的温度超出范围', '驱动柜 3 的温度超出范围', '后备电源柜 1 的温度超出范围',
       '后备电源柜 2 的温度超出范围', '后备电源柜 3 的温度超出范围', '轮毂温度超出范围', '变桨系统 AC-DC 错误',
       '变桨系统紧急变桨激活', '软件超速', '硬件超速测试失败', '驱动 1 直流母线电压低', '驱动 2 直流母线电压低',
       '驱动 3 直流母线电压低', '紧急变桨测试失败- 叶片 1 速度低', '紧急变桨测试失败- 叶片 2 速度低',
       '紧急变桨测试失败- 叶片 3 速度低', '紧急变桨系统超时', '叶片 1 变桨电机温度高', '叶片 2 变桨电机温度高',
       '叶片 3 变桨电机温度高', '驱动版本不一致', '驱动柜 1 温度超出范围', '驱动柜 2 温度超出范围',
       '驱动柜 3 温度超出范围', '后备电源柜 1 温度超出范围', '后备电源柜 2 温度超出范围',
       '后备电源柜 3 温度超出范围', '轮毂温度高', '驱动 1 供电电源故障', '驱动 2 供电电源故障',
       '驱动 3 供电电源故障', '叶片 1 的 90 度限位开关激活', '超速监控器与轮毂转速存在差异',
       '叶片 2 的 90 度限位开关激活', '叶片 3 的 90 度限位开关激活', '叶片 1 的 95 度限位开关激活',
       '叶片 2 的 95 度限位开关激活', '变桨控制柜 1 加热器供电故障', '变桨控制柜 2 加热器供电故障',
       '变桨控制柜 3 加热器供电故障', '变桨轴承油脂流量低', '变桨轴承油脂罐液位低', '变桨轴承油脂泵手动模式',
       '叶片 3 的 95 度限位开关激活', '变桨电容柜 1 电容电压低', '变桨电容柜 2 电容电压低',
       '变桨电容柜 3 电容电压低', '叶片 1 安全链故障', '叶片 2 安全链故障', '叶片 3 安全链故障',
       '叶片 1 后备电源开关断开', '叶片 2 后备电源开关断开', '叶片 3 后备电源开关断开', '网侧电流不平衡告警',
       '加热除湿告警', '水冷柜告警', 'UPS 输入告警', 'IGBT 开机时温度低告警', '加热请求告警',
       '开机时环境湿度大告警', '保留', 'Chopper  不可用告警', 'Chopper 动作次数到告警',
       '网侧模块 1 组与 2 组不均流告警', '电网电压跌落告警', '保留', '保留', '定子电流不平衡告警',
       '连续复位次数超限告警', '主控CANopen 通讯错误', 'RAM 自检失败', 'EEPROM 参数回默认值',
       'AD 零漂过大', '功率模块过热', '主断路器闭合失败', '主断路器断开失败', '预充电接触器状态反馈错', '调试错误',
       '主控通讯错误', '内部CAN 通讯错误', 'CPLD 版本不匹配', '历史故障存储失败', 'DSP 通讯协议不匹配',
       'IGBT 温度低', '主控 PB 通讯错误', '1 组 IGBT 过流（锁存）', '1 组驱动板连接错误（锁存）',
       '母线硬件过压（锁存）', '辅助电源故障（锁存）', '1 组硬件过流（锁存）', '2 组硬件过流（锁存）',
       '2 组 IGBT 过流（锁存）', '2 组驱动板连接错误（锁存）', '无刷电励磁故障 （锁存）', '电网 AB 线电压过压',
       '电网 BC 线电压过压', '电网 CA 线电压过压', '电网 AB 线电压欠压', '电网 BC 线电压欠压',
       '电网 CA 线电压欠压', '电网电压不平衡超限/缺相', '电网过频', '电网欠频', '电网相序反',
       '模块A 相软件过流', '模块B 相软件过流', '模块C 相软件过流', '模块相间电流不平衡超限', '滤波电容过流',
       '预充电滤波电容欠压', '母线预充电超时', '母线预充电过压', '母线预充电欠压', '母线不控整流过压',
       '母线不控整流欠压', '母线正常运行过压', '母线正常运行欠压', '主路熔丝断开（预留）',
       '模块 1 组与 2 组不均流故障', 'Chopper 过热', 'Chopper 单次连续动作时间超限', '电网电压跌落超限',
       'Chopper 误触发', 'Chopper 触发失败', 'Chopper 动作次数超限', 'Chopper 自检失败',
       '叶片 1-24VDC-DC 故障', '叶片 2-24VDC-DC 故障', '叶片 4-24VDC-DC 故障',
       '转矩控制启动', '转速控制启动', '无功功率控制使能', '无功功率控制关闭', '变频器功率降低', '变频器重新配置故障',
       '变频器功率重新配置要求', '变频器满功率重新配置', '变频器手动重新配置', '变频器重新配置准备好',
       '变频器重新配置超时', '电容管理单元1 充电故障', '电容管理单元2 充电故障', '电容管理单元3 充电故障',
       '叶片 1 变桨电机过温', '叶片 2 变桨电机过温', '叶片 3 变桨电机过温', '备用', '备用', '备用',
       '备用', '备用', '备用', '变桨电机1 编码器故障', '变桨电机2 编码器故障', '变桨电机3 编码器故障',
       '变桨驱动1 制动电阻温度故障', '变桨驱动2 制动电阻温度故障', '变桨驱动3 制动电阻温度故障',
       '叶片1 驱动器斩波故障', '叶片2 驱动器斩波故障', '叶片3 驱动器斩波故障', '叶片 1 驱动缺相',
       '叶片 2 驱动缺相', '叶片 3 驱动缺相', '叶片1 驱动散热器过温', '叶片2 驱动散热器过温',
       '叶片3 驱动散热器过温', '叶片1 驱动散热器过温', '叶片2 驱动散热器过温', '叶片3 驱动散热器过温',
       '叶片 1 变桨电机过温', '叶片 2 变桨电机过温', '叶片 3 变桨电机过温', '叶片 1 变桨电机过温',
       '叶片 2 变桨电机过温', '叶片 3 变桨电机过温', '叶片 1 驱动 IXT 过载', '叶片 2 驱动 IXT 过载',
       '叶片 3 驱动 IXT 过载', '叶片1 驱动母线电压过高', '叶片2 驱动母线电压过高', '叶片3 驱动母线电压过高',
       '叶片1 驱动母线电压过低', '叶片2 驱动母线电压过低', '叶片3 驱动母线电压过低', '叶片1 驱动器内部短路故障',
       '叶片2 驱动器内部短路故障', '叶片3 驱动器内部短路故障', '叶片1 驱动器接地故障', '叶片2 驱动器接地故障',
       '叶片3 驱动器接地故障', '叶片1 变桨电机编码器开路', '叶片2 变桨电机编码器开路', '叶片3 变桨电机编码器开路',
       '叶片1 变桨电机编码器通讯错误', '叶片2 变桨电机编码器通讯错误', '叶片3 变桨电机编码器通讯错误',
       '叶片1 变桨驱动钳位脉冲禁止', '叶片2 变桨驱动钳位脉冲禁止', '叶片3 变桨驱动钳位脉冲禁止',
       '叶片1 变桨驱动制动电阻 I2T 过载', '叶片2 变桨驱动制动电阻 I2T 过载',
       '叶片3 变桨驱动制动电阻 I2T 过载', '叶片1 变桨驱动钳位操作激活', '叶片2 变桨驱动钳位操作激活',
       '叶片3 变桨驱动钳位操作激活', '叶片 1 变桨电机I2T 过载', '叶片 2 变桨电机I2T 过载',
       '叶片 3 变桨电机I2T 过载', '叶片1 变桨电机相序故障', '叶片2 变桨电机相序故障', '叶片3 变桨电机相序故障',
       '叶片 1 驱动无存储器', '叶片 2 驱动无存储器', '叶片 3 驱动无存储器', '叶片1 驱动起始位置未知',
       '叶片2 驱动起始位置未知', '叶片3 驱动起始位置未知', '变桨驱动 1IO 总线故障', '变桨驱动 2IO 总线故障',
       '变桨驱动 3IO 总线故障', '变桨驱动 1CAN 故障', '变桨驱动 2CAN 故障', '变桨驱动 3CAN 故障',
       '变桨驱动1 直流电压低故障', '变桨驱动2 直流电压低故障', '变桨驱动3 直流电压低故障', '市电防雷器故障',
       '辅助变压器过温', '网侧防雷器故障', '机侧防雷器 1 故障', '机侧防雷器 2 故障', '网侧电抗器过温',
       '机侧电抗器过温', '网侧熔丝故障', '安全链状态错误', '主控脱网故障', '主断路器脱扣', '紧急停机',
       '机侧断路器脱扣', '水冷柜驱动错误', '水冷柜状态错误', '母线过温', '机侧熔丝过温', '配电柜过温', '电阻过温',
       'EEPROM 写失败', '开关柜 1#开关故障', '开关柜 2#开关故障', '开关柜故障次数到', '电网掉电',
       '主断路器脱扣次数超限', '主控转矩给定超限', '主控转矩给定突变告警超时', '孤网运行故障', '电容柜总故障',
       '电容柜投入接触器状态错误故障', '电容开路故障', '电容个数错误故障（损坏）', '水冷机RAM 自检失败',
       '水冷机 EEPROM 参数回默认值', '水冷机 EEPROM 写失败', '水冷机历史故障存储失败',
       '水冷机 CPLD 版本不匹配', '变流器入出口压差过小', '变流器入口水温过高故障', '水冷机主回路过载',
       '变流器出口水压过低', '变流器出口水压过高', '变流器入口水压过低', '变流器入口水压过高', '水冷机急停（保留）',
       '水冷机循环泵过载', '水冷机电网相序反（保留）', '水冷机内部 CAN 通讯错误', '电容柜 K1 闭合失败',
       '电容柜 K1 断开失败', '电容柜 K2 闭合失败', '电容柜 K2 断开失败', '电容有效值过流',
       '电容柜A 相晶闸管故障', '电容柜 C 相晶闸管故障', '电容柜零漂过大故障', '电容柜投入超时故障',
       '电容柜晶闸管驱动连接错误', '电容柜RAM 自检失败', '电容柜 CPLD 版本不匹配', '电容柜 EEPROM 读写失败',
       '电容柜电压同步超时', '电容柜 K3 放电回路故障', '电容柜内部 CAN 通讯故障', '过温频繁禁止复位',
       '检测板跳线错误', '网侧机侧母线电压偏差大', '母线软件过压', '母线软件欠压', '定子电流模式过大',
       '定子 1A 相有效值过流', '定子 1B 相有效值过流', '定子 1C 相有效值过流', '定子 2A 相有效值过流',
       '定子 2B 相有效值过流', '定子 2C 相有效值过流', '定子电流不平衡', '模块 1 组与 2 组电流不平衡',
       '定子缺相', '定子电压采样异常', '定子相序反', '电机并网欠速', '电机并网超速', '电机运行欠速', '电机超速',
       '同步失败', '功率模块过热', '定子电压过压', '定子漏电流过大', 'RAM 自检失败', 'EEPROM 参数回默认值',
       'CPLD 版本不匹配', 'EEPROM 写失败', '励磁电源故障', '励磁电源通讯故障', '内部CAN 通讯错误',
       '故障记录读写错误', '故障自动复位次数超限', 'AD 零漂过大', '网侧故障', '原动机模式故障', '定子开关延时断开',
       '定子过载', '机侧开关 1 闭合失败', '机侧开关 1 断开失败', '机侧开关 2 闭合失败', '机侧开关 2 断开失败',
       '1 组 IGBT 过流（锁存）', '1 组驱动板连接错误（锁存）', '母线硬件过压（锁存）', '辅助电源故障（锁存）',
       '1 组硬件过流（锁存）', '2 组硬件过流（锁存）', '2 组 IGBT 过流（锁存）', '2 组驱动板连接错误（锁存）'])

fnum = pd.Series([1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  14,
        15,  16,  17,  19,  20,  21,  22,  23,  24,  25,  26,  27,  28,
        29,  30,  31,  32,  33,  34,  35,  36,  37,  38,  40,  41,  42,
        43,  44,  45,  46,  47,  48,  50,  51,  52, 100, 101, 102, 103,
       104, 105, 106, 107, 108, 109, 110, 111, 112, 130, 131, 150, 151,
       152, 153, 154, 155, 156, 157, 158, 159, 160, 200, 201, 204, 205,
       210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 220, 221, 222,
       223, 224, 225, 226, 227, 228, 229, 230, 231, 232, 233, 234, 235,
       236, 237, 238, 239, 240, 241, 242, 243, 244, 245, 246, 247, 248,
       249, 250, 251, 252, 253, 254, 255, 256, 257, 258, 259, 260, 261,
       262, 263, 264, 265, 266, 267, 268, 269, 270, 271, 272, 273, 274,
       275, 276, 277, 278, 279, 280, 283, 284, 285, 286, 287, 288, 289,
       290, 291, 292, 293, 294, 295, 296, 297, 300, 301, 302, 303, 304,
       305, 306, 307, 308, 309, 310, 311, 312, 313, 314, 315, 316, 317,
       318, 319, 320, 321, 322, 324, 325, 326, 327, 328, 329, 330, 331,
       332, 333, 334, 335, 336, 337, 338, 339, 340, 342, 343, 344, 345,
       346, 347, 348, 349, 350, 351, 352, 353, 354, 355, 356, 357, 358,
       359, 360, 361, 362, 363, 364, 365, 366, 367, 368, 369, 370, 371,
       372, 373, 374, 375, 376, 377, 378, 379, 381, 382, 383, 384, 385,
       386, 389, 391, 392, 393, 394, 395, 396, 397, 398, 399, 401, 402,
       403, 404, 405, 406, 407, 408, 409, 410, 411, 412, 413, 414, 415,
       416, 449, 450, 451, 452, 453, 454, 455, 456, 457, 458, 459, 460,
       461, 462, 463, 464, 465, 466, 467, 468, 469, 470, 473, 474, 480,
       481, 482, 483, 484, 485, 486, 487, 488, 489, 490, 491, 492, 493,
       494, 495, 496, 497, 498, 499, 500, 501, 502, 503, 504, 505, 506,
       507, 508, 509, 510, 511, 512, 601, 602, 603, 650, 651, 652, 653,
       654, 655, 656, 657, 658, 659, 660, 661, 662, 663, 701, 702, 703,
       704, 705, 706, 707, 708, 709, 710, 711, 712, 713, 714, 715, 716,
       717, 718, 719, 720, 721, 722, 723, 724, 725, 726, 727, 728, 729,
       730, 731, 732, 733, 734, 735, 736, 737, 738, 739, 740, 741, 742,
       743, 744, 745, 746, 747, 748, 749, 750, 751, 752, 753, 754, 755,
       756, 757, 758, 759, 760, 761, 762, 763, 764, 765, 766, 767, 768,
       769, 770, 771, 772, 773, 774, 775, 776, 777, 778, 779, 780, 781,
       782, 783, 784, 794, 795, 796, 797, 798, 799, 800, 801, 802, 803,
       804, 805, 806, 807, 808, 809, 810, 811, 812, 813, 814, 815, 816,
       817, 818, 819, 820, 821, 822, 823, 824, 825, 826, 827, 828, 829,
       830, 831, 832, 833, 834, 835, 836, 837, 838, 839, 840, 841, 842,
       843, 844, 845, 846, 847, 848, 849, 850, 851, 852, 853, 854, 855,
       856, 857, 858, 859, 860, 861, 862, 863, 864, 865, 866, 867, 868,
       869, 870, 871, 872, 873, 874, 875, 876, 877, 878, 879, 880, 881,
       882, 883, 884, 885, 886, 887, 888, 889, 890, 891, 892, 893, 894,
       895, 896, 897, 898, 899, 900, 901, 902, 903, 904, 905, 906, 907,
       908])

fcon = pd.Series(['主控系统', '主控系统', '主控系统', '主控系统', '主控系统', '主控系统', '主控系统', '主控系统',
       '主控系统', '主控系统', '主控系统', '主控系统', '变流器', '主控系统', '主控系统', '变流器',
       '主控系统', '主控系统', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '发电机',
       '发电机', '发电机', '其它系统', '其它系统', '其它系统', '其它系统', '其它系统', '其它系统',
       '其它系统', '其它系统', '变流器', '叶片', '其它系统', '主控系统', '电网', '主控系统', '主控系统',
       '主控系统', '主控系统', '变桨系统', '变桨系统', '变桨系统', '变流器', '变流器', '变流器', '变流器',
       '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '主控系统',
       '电网', '箱变', '箱变', '变流器', '其它系统', '变流器', '变流器', '变流器', '变流器', '变流器',
       '变流器', '变流器', '变流器', '偏航系统', '其它系统', '其它系统', '主控系统', '主控系统',
       '偏航系统', '电网', '主控系统', '主控系统', '主控系统', '主控系统', '主控系统', '主控系统',
       '主控系统', '主控系统', '其它系统', '叶片', '叶片', '偏航系统', '偏航系统', '偏航系统', '偏航系统',
       '偏航系统', '偏航系统', '偏航系统', '风速仪风向标', '风速仪风向标', '风速仪风向标', '风速仪风向标',
       '其它系统', '其它系统', '其它系统', '其它系统', '风速仪风向标', '风速仪风向标', '主轴承', '主轴承',
       '主轴承', '主轴承', '发电机', '发电机', '发电机', '发电机', '发电机', '发电机', '发电机',
       '发电机', '发电机', '发电机', '发电机', '发电机', '主控系统', '主控系统', '其它系统', '偏航系统',
       '偏航系统', '偏航系统', '主轴承', '主轴承', '发电机', '发电机', '发电机', '发电机', '发电机',
       '发电机', '发电机', '发电机', '偏航系统', '其它系统', '其它系统', '主轴承', '主轴承', '偏航系统',
       '偏航系统', '偏航系统', '发电机', '偏航系统', '偏航系统', '主轴承', '发电机', '其它系统',
       '其它系统', '发电机', '偏航系统', '偏航系统', '偏航系统', '其它系统', '其它系统', '其它系统',
       '其它系统', '其它系统', '变桨系统', '变桨系统', '其它系统', '其它系统', '变桨系统', '变桨系统',
       '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统', '其它系统',
       '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统',
       '变桨系统', '其它系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统',
       '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统',
       '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统',
       '变桨系统', '变桨系统', '变桨系统', '其它系统', '其它系统', '变桨系统', '变桨系统', '变桨系统',
       '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统',
       '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统', '其它系统', '变桨系统',
       '变桨系统', '变桨系统', '变桨系统', '其它系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统',
       '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统',
       '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统',
       '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器',
       '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器',
       '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器',
       '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器',
       '变流器', '变流器', '变流器', '变流器', '变流器', '电网', '电网', '电网', '电网', '电网',
       '电网', '电网', '电网', '电网', '电网', '变流器', '变流器', '变流器', '变流器', '变流器',
       '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器',
       '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '变桨系统',
       '变桨系统', '变桨系统', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器',
       '变流器', '变流器', '变流器', '变流器', '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统',
       '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统',
       '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统',
       '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统',
       '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统',
       '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统',
       '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统',
       '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统',
       '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统',
       '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统',
       '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统', '变桨系统',
       '变桨系统', '变桨系统', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器',
       '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器',
       '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '电网', '变流器',
       '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器',
       '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器',
       '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器',
       '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器',
       '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器',
       '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器',
       '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器',
       '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器',
       '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器',
       '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器', '变流器'])

ftype = pd.Series(['故障停机', '提示信息', '提示信息', '提示信息', '故障停机', '提示信息', '故障停机', '提示信息'
, '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '提示信息', '提示信息', '故障停机'
, '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机'
, '故障停机', '故障停机', '故障停机', '运行告警', '运行告警', '运行告警', '运行告警', '运行告警'
, '故障停机', '运行告警', '运行告警', '故障停机', '故障停机', '运行告警', '故障停机', '电网故障'
, '故障停机', '故障停机', '运行告警', '运行告警', '故障停机', '故障停机', '故障停机', '故障停机'
, '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机'
, '故障停机', '故障停机', '故障停机', '故障停机', '电网故障', '故障停机', '运行告警', '运行告警'
, '运行告警', '运行告警', '运行告警', '运行告警', '运行告警', '运行告警', '运行告警', '运行告警'
, '提示信息', '故障停机', '提示信息', '提示信息', '故障停机', '故障停机', '故障停机', '故障停机'
, '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '提示信息', '故障停机'
, '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机'
, '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机'
, '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机'
, '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机'
, '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机'
, '运行告警', '运行告警', '运行告警', '运行告警', '运行告警', '运行告警', '运行告警', '运行告警'
, '运行告警', '运行告警', '运行告警', '运行告警', '故障停机', '运行告警', '运行告警', '运行告警'
, '运行告警', '运行告警', '运行告警', '运行告警', '运行告警', '运行告警', '运行告警', '运行告警'
, '运行告警', '运行告警', '运行告警', '运行告警', '运行告警', '故障停机', '故障停机', '故障停机'
, '故障停机', '运行告警', '运行告警', '故障停机', '提示信息', '提示信息', '提示信息', '提示信息'
, '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机'
, '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机'
, '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机'
, '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机'
, '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机'
, '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机'
, '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '运行告警', '运行告警'
, '运行告警', '运行告警', '运行告警', '运行告警', '运行告警', '运行告警', '运行告警', '运行告警'
, '运行告警', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机'
, '故障停机', '故障停机', '运行告警', '运行告警', '运行告警', '运行告警', '运行告警', '运行告警'
, '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机'
, '故障停机', '故障停机', '运行告警', '运行告警', '运行告警', '运行告警', '运行告警', '运行告警'
, '运行告警', '运行告警', '运行告警', '运行告警', '运行告警', '运行告警', '运行告警', '运行告警'
, '运行告警', '运行告警', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机'
, '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机'
, '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机'
, '故障停机', '故障停机', '故障停机', '电网故障', '电网故障', '电网故障', '电网故障', '电网故障'
, '电网故障', '电网故障', '电网故障', '电网故障', '电网故障', '故障停机', '故障停机', '故障停机'
, '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机'
, '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机'
, '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机'
, '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机'
, '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机'
, '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机'
, '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机'
, '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机'
, '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机'
, '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机'
, '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机'
, '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机'
, '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机'
, '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机'
, '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机'
, '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机'
, '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机'
, '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '电网故障'
, '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机'
, '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机'
, '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机'
, '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机'
, '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机'
, '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机'
, '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机'
, '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机'
, '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机'
, '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机'
, '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机'
, '故障停机', '故障停机', '故障停机'])


fault = pd.DataFrame({'fname':fname,'fnum':fnum.astype(int),'type':ftype,'fcon':fcon})

'''
fault = pd.read_csv('D:/test/result/hadian/duMC5TRo/XE-116/2.0/fault.csv',header=0,encoding='ANSI')
fault.drop_duplicates('故障代码',keep='first',inplace=True)
fault['故障代号'].values
fault['故障描述'].values
fault['故障类型'].values
fault['系统'].values
'''



